{
  "cells": [
    {
      "cell_type": "markdown",
      "id": "bb8f23af",
      "metadata": {
        "id": "bb8f23af"
      },
      "source": [
        "# Практическая работа №2. Циклы\n"
      ]
    },
    {
      "cell_type": "markdown",
      "id": "6ff06361",
      "metadata": {
        "id": "6ff06361"
      },
      "source": [
        "## Задание 2.1 — Цикл с параметром (текст)\n",
        "\n",
        "Задание 2.1. Цикл с параметром.\n",
        "1. Общий синтаксис цикла с параметром.\n",
        "2. Функция range().\n",
        "3. Функция enumerate().\n",
        "4. Управление выполнением цикла. Операторы break и continue\n",
        "5. Написать программу по заданию А по вариантам (см. ниже свой вариант\n",
        "задания)."
      ]
    },
    {
      "cell_type": "markdown",
      "id": "b2f969bc",
      "metadata": {
        "id": "b2f969bc"
      },
      "source": [
        "Задание 2.2. Цикл с условием\n",
        "1. Общий синтаксис цикла с условием.\n",
        "2. Написать программу по заданию В (см. свой вариант задания).\n",
        "3. Написать отчет.\n"
      ]
    },
    {
      "cell_type": "markdown",
      "id": "bd19cd44",
      "metadata": {
        "id": "bd19cd44"
      },
      "source": [
        "## Варианты заданий — Вариант 9 (из тетради)\n",
        "\n",
        "А) Напишите программу, которая выводит таблицу умножения от 1 до 10 для выбранного целого числа (number).\n",
        "\n",
        "В) Дано целое число, состоящее из разных цифр. Определить наибольшую цифру числа и вывести её."
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "id": "f56da5c6",
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "f56da5c6",
        "outputId": "11badfb1-53fc-4c42-c29d-939ae3bf64c5"
      },
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "15 x 1 = 15\n",
            "15 x 2 = 30\n",
            "15 x 3 = 45\n",
            "15 x 4 = 60\n",
            "15 x 5 = 75\n",
            "15 x 6 = 90\n",
            "15 x 7 = 105\n",
            "15 x 8 = 120\n",
            "15 x 9 = 135\n",
            "15 x 10 = 150\n"
          ]
        }
      ],
      "source": [
        "# Задание A: таблица умножения\n",
        "def mult_table(n):\n",
        "    for i in range(1,11):\n",
        "        print(f\"{n} x {i} = {n*i}\")\n",
        "\n",
        "mult_table(15)"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "id": "765ee3b5",
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "765ee3b5",
        "outputId": "bb76790e-17ba-4d87-8fd0-89e284112f99"
      },
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "Число: 5731\n",
            "Наибольшая цифра: 7\n"
          ]
        }
      ],
      "source": [
        "# Задание B: найти наибольшую цифру числа\n",
        "def max_digit(n):\n",
        "    n = abs(int(n))\n",
        "    print('Число:', n)\n",
        "    print('Наибольшая цифра:', max(int(d) for d in str(n)))\n",
        "\n",
        "max_digit(5731)"
      ]
    },
    {
      "cell_type": "markdown",
      "source": [
        "Ответы на кр вопросы:"
      ],
      "metadata": {
        "id": "3M8diOmmt8S_"
      },
      "id": "3M8diOmmt8S_"
    },
    {
      "cell_type": "markdown",
      "source": [
        "1.Общий синтаксис цикла с параметром Цикл с параметром в Python используется для выполнения действий заданное количество раз. Он основан на конструкции for, которая перебирает элементы последовательности (списка, строки, диапазона и т. д.). Общий синтаксис: for переменная in последовательность: Внутри цикла можно обращаться к текущему элементу последовательности. Пример: for i in range(5): print(i) — цикл выполняется 5 раз."
      ],
      "metadata": {
        "id": "97TdmrO8t_0s"
      },
      "id": "97TdmrO8t_0s"
    },
    {
      "cell_type": "markdown",
      "source": [
        "2.Функция range() Функция range() создаёт последовательность чисел, которую часто используют в циклах for. Она может принимать один, два или три аргумента: начало, конец и шаг. Если указан один аргумент, счёт идёт от 0 до этого числа (не включая его). Например, range(3) создаёт числа 0, 1 и 2. range(1, 5, 2) создаёт 1, 3 — то есть шаг равен 2."
      ],
      "metadata": {
        "id": "9UloXsmSuCx0"
      },
      "id": "9UloXsmSuCx0"
    },
    {
      "cell_type": "markdown",
      "source": [
        "3.Функция enumerate() Функция enumerate() используется, когда нужно получать не только элементы последовательности, но и их порядковые номера. Она возвращает пары вида (индекс, значение). Например, при переборе списка ['a','b','c'] через enumerate() можно получить (0,'a'), (1,'b'), (2,'c'). Это удобно для нумерации элементов прямо в цикле.\n"
      ],
      "metadata": {
        "id": "uN4nV88FuEo-"
      },
      "id": "uN4nV88FuEo-"
    },
    {
      "cell_type": "markdown",
      "source": [
        "4.Общий синтаксис цикла с условием Цикл с условием выполняется, пока условие остаётся истинным. Используется конструкция while. Проверка условия происходит перед каждой итерацией, и если оно ложно — цикл завершается. Пример: переменная увеличивается на 1, пока не достигнет нужного значения. Такой тип цикла подходит, когда количество повторений заранее неизвестно."
      ],
      "metadata": {
        "id": "TV26Pj99uG78"
      },
      "id": "TV26Pj99uG78"
    }
  ],
  "metadata": {
    "colab": {
      "provenance": []
    },
    "language_info": {
      "name": "python"
    },
    "kernelspec": {
      "name": "python3",
      "display_name": "Python 3"
    }
  },
  "nbformat": 4,
  "nbformat_minor": 5
}